package bac.week7.concept
/*
    1,2,3 더하기 4

    정수 n이 주어졌을 때,
    n을 1, 2, 3의 합으로 나타내는 방법의 수

    경우의 수의 분류기준을 잡는게 쉽지 않은 문제이다.

    1<= n <=10,000

idx    0 1 2 3 4 5 6 7 8
       1 1 1 1 1 1 1 1 1
         1 2 2 3 3 4 4
         1 2 3 4
    n=1
    1

    n=2
    1+1,
    2

    n=3
    (1+1+1)
    (1+2)
    3

    n=4
    1+1+1+1

    1+1+2
    2+2

    1+3

    n=5
    1+(1+1+1+1)

    1+(1+1+2)
    1+(2+2)

    1+1+3
    2+3

    n=6
    1+1+1+1+1+1

    1+(1+1+1+2)
    1+(1+2+2)
    2+(2+2)

    1+(1+1+3)
    1+(2+3)
    3+3

    n=7
    1+(1+1+1+1+1+1)
    1+(1+1+1+1+2)
    1+(1+1+1+3)
    1+(1+1+2+2)
    1+(1+2+3)
    1+(2+2+2)
    1+(3+3)
    2+2+3

 */

//val case = Array(100001) { 0 }
//fun main() = with(System.`in`.bufferedReader()) {
//
//    val tc = readLine().toInt()
//
//    case[0] = 1
//    for (i in 1..3) {
//        for (j in 1..10_000) {
//            if (j - i >= 0)
//                case[j] += case[j - i]
//        }
//    }
//
//    repeat(tc) {
//        val n = readLine().toInt()
//        println(case[n])
//    }
//    Unit
//}
